//___________________________________________________________________
//___________________________________________________________________
//  Copyright : 2018 BY HOLTEK SEMICONDUCTOR INC
//  File Name : ISR.c
// Description: 
//Targer Board: 
//   MCU      : BH67F5270
//   Author   : ming
//   Date     : 2018/03/26
//   Version  : V00
//   History  :
//___________________________________________________________________
//___________________________________________________________________
#include "common.h"

//
////@------------外部中斷0入口函數--------------@
//DEFINE_ISR(INT0_ISR, INT0_VECTOR)
//{
//
//}
////@------------外部中斷0入口函數--------------@
//DEFINE_ISR(INT1_ISR, INT1_VECTOR)
//{
//
//}
////@------------復合中斷 2入口函數--------------@
//DEFINE_ISR(ADC_ISR, ADC_VECTOR)
//{
//
//}
//
//////@------------復合中斷 0入口函數--------------@
////DEFINE_ISR(MF0_ISR, MF0_VECTOR)
////{
////
////}
//
//////@------------復合中斷 1入口函數--------------@
////DEFINE_ISR(MF1_ISR, MF1_VECTOR)
////{
////	if(_ptm1af)
////	{
////		//清除看門狗
////		GCC_CLRWDT();
////		_ptm1af = 0;			
////		gbv_work_polling = 1;
//////		fun_Key_Scan();
////		
////	}
////	if(_ptm2af)
////	{
////		_ptm2af = 0;
////	}	
////}
////
//////@------------復合中斷 2入口函數--------------@
////DEFINE_ISR(MF2_ISR, MF2_VECTOR)
////{
////
////}
//
//
////@------------復合中斷 0入口函數--------------@
//DEFINE_ISR(SCF_ISR, SCF_VECTOR)
//{
//
//}
//
////@------------復合中斷 1入口函數--------------@
//DEFINE_ISR(TB0_ISR, TB0_VECTOR)
//{
//
//}
////@------------復合中斷 1入口函數--------------@
//DEFINE_ISR(TB1_ISR, TB1_VECTOR)
//{
//	gbv_tb1_flag = 1;
////	fun_500ms_polling();
//}
//
//
//////@------------復合中斷 0入口函數--------------@
////DEFINE_ISR(UART_ISR, UART_VECTOR)
////{
////
////}
//
////@------------復合中斷 1入口函數--------------@
//DEFINE_ISR(SIM_ISR, SIM_VECTOR)
//{
//
//}
////@------------復合中斷 1入口函數--------------@
//DEFINE_ISR(SPIA_ISR, SPIA_VECTOR)
//{
//
//}


